<P> <img src="https://i.ibb.co/gyNf19D/nhslogo.png" alt="nhslogo" border="0" width="100" align="right"><font size="6"><b> CS6131 Database Design</b> </font>

# Project Scripting Phase Report Submission

### By Trinh Hoang Hai

### Submission Instructions

<div class="alert alert-block alert-info">

* You will need to submit the following files in your final project submission:
    * Your Jupyter Notebook report. Name the report `ProjectScriptingReport<YourName>.ipynb`.
    * All relevant image files to be displayed in this report (make sure you use relative file referencing and the image will display in another computer).
    * Attached each file one by one and upload on Coursemology.
* Please print a copy of the final report to OneNote Individual Notebook space > Project. Double check on the image resolution. If the resolution is poor, please copy and paste the ORIGINAL clear image into the OneNote page (paste at the side of the printed image).

* Any submission that fails to comply to the above instructions will result in upto 5% penalty.

* You may wish to refer to the following reference to help organize and "beautify" your final report here. <br>
https://thecodingbot.com/markdown-in-jupyter-ipython-notebook-cheatsheet/
</div>

### Section A: Overview & Business Rules

### Overview

<div class="alert alert-block alert-warning">
You may copy and paste the overview submitted in previous phase. Edits, if any, should be highlighted.
</div>

Online shopping is a popular alternative to visiting physical retailers. Customers can browse, buy and receive products wherever they want. One common type of online vendors are clothing stores. Unlike physical stores where space is a constraint, online stores allow for all available items to be displayed to the customer. Customers can also quickly find the product they have in mind using the search function of the store website.

To easily manage customer orders, the database should be able to relate customers to the products they bought, which is a fitting job for an RDBMS system. An RDBMS system also allows for fast queries of products, search filtering and grouping of products into multiple categories, giving the customer a better shopping experience.

### Business Rules

<div class="alert alert-block alert-warning">
Include your updated business rules writeup here. Any changes from previous submission should be highlighted.
You may consider using HTML editor for easy editing e.g. <a href="https://onlinehtmleditor.dev/">https://onlinehtmleditor.dev/</a>
</div>

Each **customer** in the database can be identified by a unique customer ID. They are required to provide an email, phone number and address for delivery purposes. <span style="background-color:#ffff00">Customers also have login details consisting of a username and a password, as well as a name and date of birth if they choose to sign up for an account.</span>

<span style="background-color:#ffff00">To draw customers</span>, the store sometimes gives out exclusive **discounts**, each with a code, start date, end date, and amount of discount. A <span style="background-color:#ffff00">customer</span> cannot have two discounts with the same code, but multiple <span style="background-color:#ffff00">customers</span> can have the same discount code. Not all <span style="background-color:#ffff00">customers</span> have discounts, but all discounts must have a customer as the owner.

Customers can write **feedbacks**, <span style="background-color:#ffff00">which are messages of all kinds for the store</span>. Feedbacks have unique IDs, <span style="background-color:#ffff00">category of feedback (complaint, questions regarding an item, request refund, etc.)</span> and the contents.

**Products** are items sold in the store. Each product has a unique product ID, a name, number of items in stock, type (shirts, pants, etc), size, price, colors and the categories it belongs to (men, women, accessories). A product can be of multiple colors and belong to multiple categories. Note that similar products with different sizes are considered 2 separate products. For example, a "Baseball Long Sleeve - B&W" of size S is a separate product from a "Baseball Long Sleeve - B&W" of size L. Each would have their own unique IDs and may have different prices.

<span style="background-color:#ffff00">Occasionally, there may be **sale** events where a (non-zero) number of products have their prices lowered. Sales are identified by a unique sale ID, start date, end date, and amount of discount. Products cannot be on more than one sales at the same time.</span>

Customers can favourite products, adding them to a wishlist. <span style="background-color:#ffff00">They can also write reviews on products. When reviewing, the user give an overall rating and a comment on the product. The time when the review was posted is also recorded.</span>

<span style="background-color:#ffff00"> **Designers** make the products. Each designer has a unique designer ID, a name, description and a link to their website (to be displayed on their information page). Designers make multiple products, and a product is made by only one designer. Only designers whose products are sold in the store are saved in the database. The date at which a product is made and given to the store is stored.</span>

**Orders** are practically the shopping carts of the online store. Each order has a unique ID and a total price. Products can be added to orders with a specified quantity, i.e how many Blue Plaid Shirts are to be put in the cart. <span style="background-color:#ffff00"> Orders are shipped to customers with a shipping cost and shipping status for tracking. The total price is derived from all the items bought and the delivery fee.</span> A customer make orders by paying for them. The date at which the order is made is recorded.

### Section B: ER Model

<div class="alert alert-block alert-warning">
Screen shot your previous ER (with teacher's marking) and insert image below (double click on the markdown and insert your img name).
</div>

<img src="oldER.png">

<div class="alert alert-block alert-warning">
Attached the image of your UPDATED ER Model here. Highlight changes made.
</div>

<img src="ER.png">

### Section C: Relational Model

<div class="alert alert-block alert-warning">
Screen shot your previous Relational Model (with teacher's marking) and insert image below.
</div>

<img src="oldSchema.png" width="700">

<div class="alert alert-block alert-warning">
Attached the image of your UPDATED Relational Model here.  Highlight changes made.
</div>

<img src="Schema.png">

<div class="alert alert-block alert-warning">
Justify your mapping strategy from ER to relational, particularly if the approach deviates from the norm, or you have inheritance in your ER model (i.e. which strategy is adopted for inheritance mapping and why).
</div>

N:1 relationships are mapped by adding the primary key of a relation as foreign key of the other to avoid creating more tables.

<div class="alert alert-block alert-warning">
If the relational schema mapped from the ER is not in 3NF, propose relevant normalization to make all relations in 3NF. You may leave this part blank if no further normalization is required.
</div>

Proposed normalization, if any

### Section D: DDL Schema

<div class="alert alert-block alert-warning">
Fill in the relevant code required to create the relations for your database based on the relational model in Section C. <br>
Your code should be end to end (i.e. I should be able to execute on my computer without much problem).
Please ensure your code can be seen clearly on oneNote.
</div>

In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqldb://root:admin@localhost/

In [3]:
%%sql
DROP DATABASE IF EXISTS STORE;
CREATE DATABASE STORE;
USE STORE;

create table customer (
  cid int,
  email varchar(50),
  phoneNo varchar(25), 
  address varchar(100),
  username varchar(50),
  password varchar(50),
  name varchar(50),
  dateOfBirth date,
  primary key (cid)
);

create table discount (
  code varchar(10),
  cid int,
  amount int,
  startDate date,
  endDate date,
  primary key (code,cid),
  foreign key (cid) references customer(cid) on delete cascade on update cascade
);

create table feedback (
  feedbackid int,
  cid int,
  category varchar(50),
  content varchar(250),
  primary key (feedbackid),
  foreign key (cid) references customer(cid) on delete cascade on update cascade
);

create table sale (
  saleid int,
  amount int,
  startDate date,
  endDate date,
  primary key (saleid)
);

create table designer (
  designerid int,
  name varchar(50),
  bio TEXT, # desc is a reserved word
  website varchar(100),
  primary key (designerid)
);

create table product (
  pid int,
  name varchar(50),
  stock int,
  type varchar(20),
  size varchar(4),
  price float,
  saleid int,
  designerid int,
  addDate date,
  primary key (pid),
  foreign key (saleid) references sale(saleid) on delete cascade on update cascade,
  foreign key (designerid) references designer(designerid) on delete cascade on update cascade
);

create table review (
  pid int,
  cid int,
  rating int,
  comment varchar(250),
  date date,
  primary key (pid, cid),
  foreign key (pid) references product(pid) on delete cascade on update cascade,
  foreign key (cid) references customer(cid) on delete cascade on update cascade
);

create table color (
  pid int,
  color varchar(10),
  primary key (pid, color),
  foreign key (pid) references product(pid) on delete cascade on update cascade
);

create table category (
  pid int,
  category varchar(20),
  primary key (pid, category),
  foreign key (pid) references product(pid) on delete cascade on update cascade
);

create table cart ( # order is a reserved word
  cartid int,
  totalPrice float,
  cid int,
  date date,
  shipCost float,
  status varchar(50),
  primary key (cartid),
  foreign key (cid) references customer (cid) on delete cascade on update cascade
);

create table favourite (
  pid int,
  cid int,
  primary key(pid,cid),
  foreign key (pid) references product(pid) on delete cascade on update cascade,
  foreign key (cid) references customer(cid) on delete cascade on update cascade
);

create table addedto (
  pid int,
  cartid int,
  quantity int,
  primary key(pid,cartid),
  foreign key (pid) references product(pid) on delete cascade on update cascade,
  foreign key (cartid) references cart(cartid) on delete cascade on update cascade
);

 * mysql+mysqldb://root:***@localhost/
12 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
(MySQLdb.OperationalError) (1065, 'Query was empty')
(Background on this error at: http://sqlalche.me/e/e3q8)

### Section E: Data Population Script

<div class="alert alert-block alert-warning">
Fill in relevant code to populate data into your database. Note that you should use INSERT commands.
You should populate each table with at least 5 to 10 records (as a prototype). You may continue adding more data over term break to prepare for the final project. This current submitted data set need not be final/complete, but should be sufficient to demonstrate the results in Section F.
    
Note that data should be realistic and logically related / coherent.
</div>

In [4]:
%%sql
INSERT INTO customer VALUES (2904,"EllieCremin@gmail.com","(504) 408-5896 x7526","Suite 460 72502 Murray Throughway, Ionafort, SD 87176","elliecremin","elliecremin737","Ellie Cremin","1965-02-14");
INSERT INTO customer VALUES (4224,"CatherinaMoen@gmail.com","(828) 618-6911","Apt. 490 656 O'Reilly Haven, North Kathaleen, RI 23054","catherinamoen","catherinamoen442","Catherina Moen","1971-09-14");
INSERT INTO customer VALUES (1866,"HansWolf@gmail.com","(256) 209-9024 x9933","Suite 103 1504 Bartell Courts, New Delfinamouth, LA 11280","hanswolf","hanswolf217","Hans Wolf","1987-10-12");
INSERT INTO customer VALUES (421,"ElnoraFerry@gmail.com","(715) 305-2593","Suite 130 310 Conn Lodge, Wehnermouth, LA 66636","elnoraferry","elnoraferry861","Elnora Ferry","1967-08-17");
INSERT INTO customer VALUES (95,"PatsyHauck@gmail.com","(562) 616-6787 x3247","Suite 286 455 Senger Garden, Greenburgh, SD 83527","patsyhauck","patsyhauck297","Patsy Hauck","1958-11-19");
INSERT INTO customer VALUES (1256,"CaryRogahn@gmail.com","(914) 513-1752","949 Courtney Rest, Herbertport, NV 89459","caryrogahn","caryrogahn963","Cary Rogahn","1977-11-07");
INSERT INTO customer VALUES (328,"MargaritoCarter@gmail.com","(651) 219-1947","370 Cole Wall, New Karrie, MD 64577","margaritocarter","margaritocarter801","Margarito Carter","1981-09-14");
INSERT INTO customer VALUES (4123,"JewellHowell@gmail.com","(972) 212-9178","Apt. 161 329 Lowe Ridges, North Ward, RI 52815","jewellhowell","jewellhowell195","Jewell Howell","1986-09-25");
INSERT INTO customer VALUES (9245,"TraciHessel@gmail.com","(860) 469-0000","768 Kendall Plain, Trevaport, PA 63853","tracihessel","tracihessel566","Traci Hessel","1981-01-19");
INSERT INTO customer VALUES (2210,"JcO'Connell@gmail.com","(313) 203-3152 x1920","Suite 931 29113 Greenfelder Village, West Jennifer, MA 59678","jco'connell","jco'connell407","Jc O'Connell","2004-09-30");

INSERT INTO discount VALUES ("code1",2904,10,"2023-02-01","2023-03-31");
INSERT INTO discount VALUES ("code2",2904,10,"2023-02-21","2023-03-30");
INSERT INTO discount VALUES ("code3",328,5,"2023-02-11","2023-03-25");
INSERT INTO discount VALUES ("code1",4224,20,"2023-02-06","2023-03-26");
INSERT INTO discount VALUES ("code1",328,5,"2023-02-12","2023-04-11");

INSERT INTO feedback VALUES (5135,95,"Request order cancellation","Pls cancel order");
INSERT INTO feedback VALUES (54265,1256,"Missing items","Where are my pants?");
INSERT INTO feedback VALUES (231,9245,"Request refund","I want a refund");
INSERT INTO feedback VALUES (7685,2210,"Other","What is this?");
INSERT INTO feedback VALUES (34325,1866,"Other","Ugly website, bad database");

INSERT INTO sale VALUES (9356,20,"2023-02-01","2023-03-31");
INSERT INTO sale VALUES (658,10,"2023-02-21","2023-03-30");
INSERT INTO sale VALUES (856,50,"2023-02-11","2023-03-25");
INSERT INTO sale VALUES (3468,40,"2023-02-06","2023-03-26");
INSERT INTO sale VALUES (6450,25,"2023-02-12","2023-04-11");

INSERT INTO designer VALUES (5992,"ADbros","Official UGC creator and developer!","https://www.roblox.com/users/23988269/profile");
INSERT INTO designer VALUES (8757,"cyutsee","certified idiot","https://www.roblox.com/users/36897775/profile");
INSERT INTO designer VALUES (5941,"FrancklinDay","UGC Creator/ 3d artist","https://www.roblox.com/users/155179916/profile");
INSERT INTO designer VALUES (9231,"AshCraft","hi im a 3D artist and a UGC creator","https://www.roblox.com/users/13461533/profile");
INSERT INTO designer VALUES (6433,"Racoamigos","Bienvenidos Racoamigos! Este es un canal de Fans y amigos de mi canal de youtube: Raconidas.","https://www.roblox.com/groups/4559112/Racoamigos#!/about");

INSERT INTO product VALUES (4443,"Blue Plaid Shirt",166,"Shirt","S",21.8,null,5992,"2023-02-01");
INSERT INTO product VALUES (4444,"Blue Plaid Shirt",136,"Shirt","M",22.8,null,5992,"2023-02-01");
INSERT INTO product VALUES (4445,"Blue Plaid Shirt",146,"Shirt","L",23.8,null,5992,"2023-02-01");
INSERT INTO product VALUES (3670,"Ripped Skater Pants",38,"Pants","M",37.2,658,8757,"2023-01-01");
INSERT INTO product VALUES (3671,"Ripped Skater Pants",63,"Pants","L",37.2,658,8757,"2023-01-01");
INSERT INTO product VALUES (9880,"I Feel Bricky 2",99,"Pants","S",24.8,null,5941,"2023-01-02");
INSERT INTO product VALUES (9881,"I Feel Bricky 2",69,"Pants","M",24.8,null,5941,"2023-01-02");
INSERT INTO product VALUES (5395,"My Favourite Pizza Shirt",214,"Shirt","L",36.6,6450,9231,"2021-02-01");
INSERT INTO product VALUES (5396,"My Favourite Pizza Shirt",124,"Shirt","XL",38.6,6450,9231,"2021-02-01");
INSERT INTO product VALUES (8997,"Denim Jacket with White Hoodies",143,"Jacket","S",50.2,9356,6433,"2022-05-01");
INSERT INTO product VALUES (8998,"Denim Jacket with White Hoodies",123,"Jacket","M",52.2,9356,6433,"2022-05-01");
INSERT INTO product VALUES (8999,"Denim Jacket with White Hoodies",133,"Jacket","L",54.2,9356,6433,"2022-05-01");
INSERT INTO product VALUES (4613,"Cat Ears",10,"Accessories",null,999.0,856,6433,"2023-01-11");
INSERT INTO product VALUES (3512,"Cat Ears 2.0",5,"Accessories",null,9999.0,3468,6433,"2023-01-11");

INSERT INTO review VALUES (4613,4123,5,"Life changing.","2023-02-20");
INSERT INTO review VALUES (9880,95,4,"It's alright","2023-01-20");
INSERT INTO review VALUES (4445,95,3,"A bit large","2023-01-20");
INSERT INTO review VALUES (9880,2210,5,"I like it","2022-12-20");
INSERT INTO review VALUES (3512,1866,5,"Truly the greatest invention of our time.","2023-02-13");

INSERT INTO color VALUES (4443,"Blue");
INSERT INTO color VALUES (4444,"Blue");
INSERT INTO color VALUES (4445,"Blue");
INSERT INTO color VALUES (3670,"Black");
INSERT INTO color VALUES (3671,"Black");
INSERT INTO color VALUES (9880,"Blue");
INSERT INTO color VALUES (9881,"Blue");
INSERT INTO color VALUES (5395,"Blue");
INSERT INTO color VALUES (5396,"Blue");
INSERT INTO color VALUES (8997,"Blue");
INSERT INTO color VALUES (8997,"White");
INSERT INTO color VALUES (8998,"Blue");
INSERT INTO color VALUES (8998,"White");
INSERT INTO color VALUES (8999,"Blue");
INSERT INTO color VALUES (8999,"White");
INSERT INTO color VALUES (4613,"White");
INSERT INTO color VALUES (4613,"Pink");
INSERT INTO color VALUES (3512,"Black");
INSERT INTO color VALUES (3512,"Pink");

INSERT INTO category VALUES (4443,"Men");
INSERT INTO category VALUES (4443,"Tops");
INSERT INTO category VALUES (4444,"Men");
INSERT INTO category VALUES (4444,"Tops");
INSERT INTO category VALUES (4445,"Men");
INSERT INTO category VALUES (4445,"Tops");
INSERT INTO category VALUES (3670,"Men");
INSERT INTO category VALUES (3670,"Bottoms");
INSERT INTO category VALUES (3671,"Men");
INSERT INTO category VALUES (3671,"Bottoms");
INSERT INTO category VALUES (9880,"Men");
INSERT INTO category VALUES (9880,"Women");
INSERT INTO category VALUES (9880,"Bottoms");
INSERT INTO category VALUES (9881,"Men");
INSERT INTO category VALUES (9881,"Women");
INSERT INTO category VALUES (9881,"Bottoms");
INSERT INTO category VALUES (5395,"Women");
INSERT INTO category VALUES (5395,"Tops");
INSERT INTO category VALUES (5396,"Women");
INSERT INTO category VALUES (5396,"Tops");
INSERT INTO category VALUES (8997,"Men");
INSERT INTO category VALUES (8997,"Women");
INSERT INTO category VALUES (8997,"Tops");
INSERT INTO category VALUES (8998,"Men");
INSERT INTO category VALUES (8998,"Women");
INSERT INTO category VALUES (8998,"Tops");
INSERT INTO category VALUES (8999,"Men");
INSERT INTO category VALUES (8999,"Women");
INSERT INTO category VALUES (8999,"Tops");
INSERT INTO category VALUES (4613,"Men");
INSERT INTO category VALUES (4613,"Women");
INSERT INTO category VALUES (4613,"Accesories");
INSERT INTO category VALUES (3512,"Men");
INSERT INTO category VALUES (3512,"Women");
INSERT INTO category VALUES (3512,"Accesories");

INSERT INTO cart VALUES (194,38.6,1866,"2023-01-12",5.0,"Delivered");
INSERT INTO cart VALUES (694,10112.0,421,"2023-02-19",5.0,"Out for delivery");
INSERT INTO cart VALUES (695,87.2,421,null,null,null);
INSERT INTO cart VALUES (24,88.8,95,"2023-01-10",5.0,"Canceled");
INSERT INTO cart VALUES (25,2035.2,95,"2023-01-11",5.0,"Delivered");
INSERT INTO cart VALUES (532,10125.8,2210,"2023-01-12",5.0,"Delivered");
INSERT INTO cart VALUES (323,52.2,2210,"2023-02-19",5.0,"Out for delivery");
INSERT INTO cart VALUES (976,54.2,9245,null,null,null);
INSERT INTO cart VALUES (865,87.4,1256,"2023-01-10",5.0,"Canceled");
INSERT INTO cart VALUES (356,84.8,1256,"2023-01-11",5.0,"Delivered");

INSERT INTO favourite VALUES (4613,328);
INSERT INTO favourite VALUES (4613,2210);
INSERT INTO favourite VALUES (4613,2904);
INSERT INTO favourite VALUES (8999,328);
INSERT INTO favourite VALUES (3512,4224);

INSERT INTO addedto VALUES (5396,194,1);
INSERT INTO addedto VALUES (5396,694,1);
INSERT INTO addedto VALUES (9880,694,3);
INSERT INTO addedto VALUES (3512,694,1);
INSERT INTO addedto VALUES (4443,695,4);
INSERT INTO addedto VALUES (5396,24,1);
INSERT INTO addedto VALUES (8997,24,1);
INSERT INTO addedto VALUES (4613,25,2);
INSERT INTO addedto VALUES (3670,25,1);
INSERT INTO addedto VALUES (5396,532,2);
INSERT INTO addedto VALUES (9880,532,2);
INSERT INTO addedto VALUES (3512,532,1);
INSERT INTO addedto VALUES (8998,323,1);
INSERT INTO addedto VALUES (8999,976,1);
INSERT INTO addedto VALUES (3671,865,1);
INSERT INTO addedto VALUES (8997,865,1);
INSERT INTO addedto VALUES (4445,356,2);
INSERT INTO addedto VALUES (3670,356,1);

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
(MySQLdb.OperationalError) (1065, 'Query was empty')
(Background on this error at: http://sqlalche.me/e/e3q8)

<div class="alert alert-block alert-warning">
Add in relevant select statements to show that your data is populated correctly FOR EACH relation, one cell each relation.
</div>

In [5]:
%%sql
select * from customer

 * mysql+mysqldb://root:***@localhost/
10 rows affected.

[(95, 'PatsyHauck@gmail.com', '(562) 616-6787 x3247', 'Suite 286 455 Senger Garden, Greenburgh, SD 83527', 'patsyhauck', 'patsyhauck297', 'Patsy Hauck', datetime.date(1958, 11, 19)),
 (328, 'MargaritoCarter@gmail.com', '(651) 219-1947', '370 Cole Wall, New Karrie, MD 64577', 'margaritocarter', 'margaritocarter801', 'Margarito Carter', datetime.date(1981, 9, 14)),
 (421, 'ElnoraFerry@gmail.com', '(715) 305-2593', 'Suite 130 310 Conn Lodge, Wehnermouth, LA 66636', 'elnoraferry', 'elnoraferry861', 'Elnora Ferry', datetime.date(1967, 8, 17)),
 (1256, 'CaryRogahn@gmail.com', '(914) 513-1752', '949 Courtney Rest, Herbertport, NV 89459', 'caryrogahn', 'caryrogahn963', 'Cary Rogahn', datetime.date(1977, 11, 7)),
 (1866, 'HansWolf@gmail.com', '(256) 209-9024 x9933', 'Suite 103 1504 Bartell Courts, New Delfinamouth, LA 11280', 'hanswolf', 'hanswolf217', 'Hans Wolf', datetime.date(1987, 10, 12)),
 (2210, "JcO'Connell@gmail.com", '(313) 203-3152 x1920', 'Suite 931 29113 Greenfelder Village, West Jennifer, MA 59678', "jco'connell", "jco'connell407", "Jc O'Connell", datetime.date(2004, 9, 30)),
 (2904, 'EllieCremin@gmail.com', '(504) 408-5896 x7526', 'Suite 460 72502 Murray Throughway, Ionafort, SD 87176', 'elliecremin', 'elliecremin737', 'Ellie Cremin', datetime.date(1965, 2, 14)),
 (4123, 'JewellHowell@gmail.com', '(972) 212-9178', 'Apt. 161 329 Lowe Ridges, North Ward, RI 52815', 'jewellhowell', 'jewellhowell195', 'Jewell Howell', datetime.date(1986, 9, 25)),
 (4224, 'CatherinaMoen@gmail.com', '(828) 618-6911', "Apt. 490 656 O'Reilly Haven, North Kathaleen, RI 23054", 'catherinamoen', 'catherinamoen442', 'Catherina Moen', datetime.date(1971, 9, 14)),
 (9245, 'TraciHessel@gmail.com', '(860) 469-0000', '768 Kendall Plain, Trevaport, PA 63853', 'tracihessel', 'tracihessel566', 'Traci Hessel', datetime.date(1981, 1, 19))]

In [6]:
%%sql
select * from discount

 * mysql+mysqldb://root:***@localhost/
5 rows affected.

[('code1', 328, 5, datetime.date(2023, 2, 12), datetime.date(2023, 4, 11)),
 ('code1', 2904, 10, datetime.date(2023, 2, 1), datetime.date(2023, 3, 31)),
 ('code1', 4224, 20, datetime.date(2023, 2, 6), datetime.date(2023, 3, 26)),
 ('code2', 2904, 10, datetime.date(2023, 2, 21), datetime.date(2023, 3, 30)),
 ('code3', 328, 5, datetime.date(2023, 2, 11), datetime.date(2023, 3, 25))]

In [7]:
%%sql
select * from feedback

 * mysql+mysqldb://root:***@localhost/
5 rows affected.

[(231, 9245, 'Request refund', 'I want a refund'),
 (5135, 95, 'Request order cancellation', 'Pls cancel order'),
 (7685, 2210, 'Other', 'What is this?'),
 (34325, 1866, 'Other', 'Ugly website, bad database'),
 (54265, 1256, 'Missing items', 'Where are my pants?')]

In [8]:
%%sql
select * from sale

 * mysql+mysqldb://root:***@localhost/
5 rows affected.

[(658, 10, datetime.date(2023, 2, 21), datetime.date(2023, 3, 30)),
 (856, 50, datetime.date(2023, 2, 11), datetime.date(2023, 3, 25)),
 (3468, 40, datetime.date(2023, 2, 6), datetime.date(2023, 3, 26)),
 (6450, 25, datetime.date(2023, 2, 12), datetime.date(2023, 4, 11)),
 (9356, 20, datetime.date(2023, 2, 1), datetime.date(2023, 3, 31))]

In [9]:
%%sql
select * from designer

 * mysql+mysqldb://root:***@localhost/
5 rows affected.

[(5941, 'FrancklinDay', 'UGC Creator/ 3d artist', 'https://www.roblox.com/users/155179916/profile'),
 (5992, 'ADbros', 'Official UGC creator and developer!', 'https://www.roblox.com/users/23988269/profile'),
 (6433, 'Racoamigos', 'Bienvenidos Racoamigos! Este es un canal de Fans y amigos de mi canal de youtube: Raconidas.', 'https://www.roblox.com/groups/4559112/Racoamigos#!/about'),
 (8757, 'cyutsee', 'certified idiot', 'https://www.roblox.com/users/36897775/profile'),
 (9231, 'AshCraft', 'hi im a 3D artist and a UGC creator', 'https://www.roblox.com/users/13461533/profile')]

In [10]:
%%sql
select * from product order by name

 * mysql+mysqldb://root:***@localhost/
14 rows affected.

[(4443, 'Blue Plaid Shirt', 166, 'Shirt', 'S', 21.8, None, 5992, datetime.date(2023, 2, 1)),
 (4444, 'Blue Plaid Shirt', 136, 'Shirt', 'M', 22.8, None, 5992, datetime.date(2023, 2, 1)),
 (4445, 'Blue Plaid Shirt', 146, 'Shirt', 'L', 23.8, None, 5992, datetime.date(2023, 2, 1)),
 (4613, 'Cat Ears', 10, 'Accessories', None, 999.0, 856, 6433, datetime.date(2023, 1, 11)),
 (3512, 'Cat Ears 2.0', 5, 'Accessories', None, 9999.0, 3468, 6433, datetime.date(2023, 1, 11)),
 (8997, 'Denim Jacket with White Hoodies', 143, 'Jacket', 'S', 50.2, 9356, 6433, datetime.date(2022, 5, 1)),
 (8998, 'Denim Jacket with White Hoodies', 123, 'Jacket', 'M', 52.2, 9356, 6433, datetime.date(2022, 5, 1)),
 (8999, 'Denim Jacket with White Hoodies', 133, 'Jacket', 'L', 54.2, 9356, 6433, datetime.date(2022, 5, 1)),
 (9880, 'I Feel Bricky 2', 99, 'Pants', 'S', 24.8, None, 5941, datetime.date(2023, 1, 2)),
 (9881, 'I Feel Bricky 2', 69, 'Pants', 'M', 24.8, None, 5941, datetime.date(2023, 1, 2)),
 (5395, 'My Favourite Pizza Shirt', 214, 'Shirt', 'L', 36.6, 6450, 9231, datetime.date(2021, 2, 1)),
 (5396, 'My Favourite Pizza Shirt', 124, 'Shirt', 'XL', 38.6, 6450, 9231, datetime.date(2021, 2, 1)),
 (3670, 'Ripped Skater Pants', 38, 'Pants', 'M', 37.2, 658, 8757, datetime.date(2023, 1, 1)),
 (3671, 'Ripped Skater Pants', 63, 'Pants', 'L', 37.2, 658, 8757, datetime.date(2023, 1, 1))]

In [11]:
%%sql
select * from review

 * mysql+mysqldb://root:***@localhost/
5 rows affected.

[(3512, 1866, 5, 'Truly the greatest invention of our time.', datetime.date(2023, 2, 13)),
 (4445, 95, 3, 'A bit large', datetime.date(2023, 1, 20)),
 (4613, 4123, 5, 'Life changing.', datetime.date(2023, 2, 20)),
 (9880, 95, 4, "It's alright", datetime.date(2023, 1, 20)),
 (9880, 2210, 5, 'I like it', datetime.date(2022, 12, 20))]

In [12]:
%%sql
select * from color

 * mysql+mysqldb://root:***@localhost/
19 rows affected.

[(3512, 'Black'),
 (3512, 'Pink'),
 (3670, 'Black'),
 (3671, 'Black'),
 (4443, 'Blue'),
 (4444, 'Blue'),
 (4445, 'Blue'),
 (4613, 'Pink'),
 (4613, 'White'),
 (5395, 'Blue'),
 (5396, 'Blue'),
 (8997, 'Blue'),
 (8997, 'White'),
 (8998, 'Blue'),
 (8998, 'White'),
 (8999, 'Blue'),
 (8999, 'White'),
 (9880, 'Blue'),
 (9881, 'Blue')]

In [13]:
%%sql
select * from category

 * mysql+mysqldb://root:***@localhost/
35 rows affected.

[(3512, 'Accesories'),
 (3512, 'Men'),
 (3512, 'Women'),
 (3670, 'Bottoms'),
 (3670, 'Men'),
 (3671, 'Bottoms'),
 (3671, 'Men'),
 (4443, 'Men'),
 (4443, 'Tops'),
 (4444, 'Men'),
 (4444, 'Tops'),
 (4445, 'Men'),
 (4445, 'Tops'),
 (4613, 'Accesories'),
 (4613, 'Men'),
 (4613, 'Women'),
 (5395, 'Tops'),
 (5395, 'Women'),
 (5396, 'Tops'),
 (5396, 'Women'),
 (8997, 'Men'),
 (8997, 'Tops'),
 (8997, 'Women'),
 (8998, 'Men'),
 (8998, 'Tops'),
 (8998, 'Women'),
 (8999, 'Men'),
 (8999, 'Tops'),
 (8999, 'Women'),
 (9880, 'Bottoms'),
 (9880, 'Men'),
 (9880, 'Women'),
 (9881, 'Bottoms'),
 (9881, 'Men'),
 (9881, 'Women')]

In [14]:
%%sql
select * from cart

 * mysql+mysqldb://root:***@localhost/
10 rows affected.

[(24, 88.8, 95, datetime.date(2023, 1, 10), 5.0, 'Canceled'),
 (25, 2035.2, 95, datetime.date(2023, 1, 11), 5.0, 'Delivered'),
 (194, 38.6, 1866, datetime.date(2023, 1, 12), 5.0, 'Delivered'),
 (323, 52.2, 2210, datetime.date(2023, 2, 19), 5.0, 'Out for delivery'),
 (356, 84.8, 1256, datetime.date(2023, 1, 11), 5.0, 'Delivered'),
 (532, 10125.8, 2210, datetime.date(2023, 1, 12), 5.0, 'Delivered'),
 (694, 10112.0, 421, datetime.date(2023, 2, 19), 5.0, 'Out for delivery'),
 (695, 87.2, 421, None, None, None),
 (865, 87.4, 1256, datetime.date(2023, 1, 10), 5.0, 'Canceled'),
 (976, 54.2, 9245, None, None, None)]

In [15]:
%%sql
select * from favourite

 * mysql+mysqldb://root:***@localhost/
5 rows affected.

[(4613, 328), (8999, 328), (4613, 2210), (4613, 2904), (3512, 4224)]

In [16]:
%%sql
select * from addedto

 * mysql+mysqldb://root:***@localhost/
18 rows affected.

[(3512, 532, 1),
 (3512, 694, 1),
 (3670, 25, 1),
 (3670, 356, 1),
 (3671, 865, 1),
 (4443, 695, 4),
 (4445, 356, 2),
 (4613, 25, 2),
 (5396, 24, 1),
 (5396, 194, 1),
 (5396, 532, 2),
 (5396, 694, 1),
 (8997, 24, 1),
 (8997, 865, 1),
 (8998, 323, 1),
 (8999, 976, 1),
 (9880, 532, 2),
 (9880, 694, 3)]

### Section F: Queries Script

<div class="alert alert-block alert-warning">
<b>SQL Query:</b> <br>
    
* Pose 3 interesting questions (asked by end user/administrator of your domain) and write SELECT queries to answer them. State the question that is being asked for each query, and also a short explanation of why the question is relevant to the domain. If relevant, you may wish to implement the query as a view or stored procedure.
 
* Write the full SELECT statement that answers the query. 
 
* Each query must be sufficiently complex (join of a few tables, use of aggregate functions, nested queries etc). Ideally, these queries should be implemented in your final web interface.
 
* Finally, show a copy of the result set produced by each query. 

* Please ensure your code can be seen clearly from oneNote.
</div>

#### Query 1

This is the filter for the store's search function, allows users to browse more easily. 

- Check if either name or designer name contains search term
- Check if product matches requirements on type, size, price, color, category
- Sort the products based on added date / price
- Returns the id of the product.

In [34]:
%%sql
drop procedure if exists search;

create procedure search(in _search varchar(50), in _type varchar(20), in _size varchar(4), in _price float,
                        in _color varchar(10), in _category varchar(20), in cum varchar(10))
begin
    select distinct product.pid, price, addDate
    from product, color, category, designer
    where product.pid = color.pid and product.pid = category.pid and designer.designerid = product.designerid
    and (_search is null or product.name like CONCAT('%', _search , '%') or designer.name like CONCAT('%', _search , '%')) 
    and (_type is null or type = _type)
    and (_size is null or size = _size)
    and (_price is null or price < _price)
    and (_color is null or color = _color)
    and (_category is null or category = _category)
    order by (case cum
        when "pricemin" then price
        when "pricemax" then -price
        else -addDate
    end);
end;

call search(null,"Shirt",null,37,null,"Tops","pricemax")

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
(MySQLdb.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 17")
[SQL: create procedure search(in _search varchar(50), in _type varchar(20), in _size varchar(4), in _price float,
                        in _color varchar(10), in _category varchar(20), in cum varchar(10))
begin
    select distinct product.pid, price, addDate
    from product, color, category, designer
    where product.pid = color.pid and product.pid = category.pid and designer.designerid = product.designerid
    and (_search is null or product.name like CONCAT('%%', _search , '%%') or designer.name like CONCAT('%%', _search , '%%'))
    and (_type is null or type = _type)
    and (_size is null or size = _size)
    and (_price is null or price < _price)
    and (_color is null or color = _color)
    and (_category is null or category = _category)
    order by (case cum
        when "pricemin" then price
        when "pricemax" then -price
        else -addDate
    end);]
(Background on this error at: http://sqlalche.me/e/f405)

In [18]:
%%sql
set @cock = 'pricemin';
select distinct product.pid, price, addDate
from product, color, category, designer
order by case @cock
    when "pricemin" then price
    when "pricemax" then "-price"
    else "-addDate"
end

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
14 rows affected.

[(4443, 21.8, datetime.date(2023, 2, 1)),
 (4444, 22.8, datetime.date(2023, 2, 1)),
 (4445, 23.8, datetime.date(2023, 2, 1)),
 (9880, 24.8, datetime.date(2023, 1, 2)),
 (9881, 24.8, datetime.date(2023, 1, 2)),
 (5395, 36.6, datetime.date(2021, 2, 1)),
 (3670, 37.2, datetime.date(2023, 1, 1)),
 (3671, 37.2, datetime.date(2023, 1, 1)),
 (5396, 38.6, datetime.date(2021, 2, 1)),
 (8997, 50.2, datetime.date(2022, 5, 1)),
 (8998, 52.2, datetime.date(2022, 5, 1)),
 (8999, 54.2, datetime.date(2022, 5, 1)),
 (4613, 999.0, datetime.date(2023, 1, 11)),
 (3512, 9999.0, datetime.date(2023, 1, 11))]

In [19]:
%%sql
call search(null,"Shirt",null,37,null,"Tops","pricemax")

 * mysql+mysqldb://root:***@localhost/
(MySQLdb.OperationalError) (1305, 'PROCEDURE store.search does not exist')
[SQL: call search(null,"Shirt",null,37,null,"Tops","pricemax")]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### Query 2

What are the products bought most often by each customer? For each customer who has bought a product, list the customer's id and name, the products's id, name and quantity bought by the customer. Arrange the quantity in descending order.

This could be useful in evaluating what customers are more interested in and recommending products.

In [20]:
%%sql
select customer.cid, customer.name as cname, product.pid, product.name as pname, sum(quantity)
from customer, cart, (
    select cart.cartid, addedto.pid as pid, sum(quantity) as quantity
    from cart, addedto
    where cart.cartid = addedto.cartid
    group by cart.cartid,addedto.pid
) t, product
where customer.cid = cart.cid and cart.cartid = t.cartid and t.pid = product.pid and date is not null
group by customer.cid, customer.name, pid
order by cid, sum(quantity) desc

 * mysql+mysqldb://root:***@localhost/
16 rows affected.

[(95, 'Patsy Hauck', 4613, 'Cat Ears', Decimal('2')),
 (95, 'Patsy Hauck', 5396, 'My Favourite Pizza Shirt', Decimal('1')),
 (95, 'Patsy Hauck', 8997, 'Denim Jacket with White Hoodies', Decimal('1')),
 (95, 'Patsy Hauck', 3670, 'Ripped Skater Pants', Decimal('1')),
 (421, 'Elnora Ferry', 9880, 'I Feel Bricky 2', Decimal('3')),
 (421, 'Elnora Ferry', 3512, 'Cat Ears 2.0', Decimal('1')),
 (421, 'Elnora Ferry', 5396, 'My Favourite Pizza Shirt', Decimal('1')),
 (1256, 'Cary Rogahn', 4445, 'Blue Plaid Shirt', Decimal('2')),
 (1256, 'Cary Rogahn', 3670, 'Ripped Skater Pants', Decimal('1')),
 (1256, 'Cary Rogahn', 3671, 'Ripped Skater Pants', Decimal('1')),
 (1256, 'Cary Rogahn', 8997, 'Denim Jacket with White Hoodies', Decimal('1')),
 (1866, 'Hans Wolf', 5396, 'My Favourite Pizza Shirt', Decimal('1')),
 (2210, "Jc O'Connell", 5396, 'My Favourite Pizza Shirt', Decimal('2')),
 (2210, "Jc O'Connell", 9880, 'I Feel Bricky 2', Decimal('2')),
 (2210, "Jc O'Connell", 8998, 'Denim Jacket with White Hoodies', Decimal('1')),
 (2210, "Jc O'Connell", 3512, 'Cat Ears 2.0', Decimal('1'))]

#### Query 3

For every pair of products bought in the same order, count the number of times that they have been bought together. Rank the pairs by this count in descending order.

This query finds out which two products are most frequently bought together and can be used for the recommendation system.

In [21]:
%%sql
select p1.name as 'Product 1', p2.name as 'Product 2', count(*)
from addedto a1, addedto a2, product p1, product p2, cart
where a1.cartid = a2.cartid and a1.pid <> a2.pid
and p1.pid = a1.pid and p2.pid = a2.pid
and cart.cartid = a1.cartid and cart.date is not null
and p1.name < p2.name
group by p1.name, p2.name
order by count(*) desc

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('I Feel Bricky 2', 'My Favourite Pizza Shirt', 2),
 ('Cat Ears 2.0', 'My Favourite Pizza Shirt', 2),
 ('Cat Ears 2.0', 'I Feel Bricky 2', 2),
 ('Blue Plaid Shirt', 'Ripped Skater Pants', 1),
 ('Cat Ears', 'Ripped Skater Pants', 1),
 ('Denim Jacket with White Hoodies', 'Ripped Skater Pants', 1),
 ('Denim Jacket with White Hoodies', 'My Favourite Pizza Shirt', 1)]

<div class="alert alert-block alert-warning">
<b>Triggers and Events:</b> <br>
Shortlist relevant triggers or scheduled events that are useful for your database system. 
Describe what the trigger/event is for and why it is useful for your DB.
</div>

#### Trigger/Event

Calculate total price of each order, trigger when the cart content is changed.

In [22]:
%%sql
CREATE TRIGGER calcTotalPrice1
AFTER INSERT ON addedto
FOR EACH ROW
BEGIN
    UPDATE cart
    SET totalPrice = totalPrice + (
        select price from product
        where product.pid = new.pid
    )*new.quantity where cartid = new.cartid;
END;

CREATE TRIGGER calcTotalPrice2
AFTER UPDATE ON addedto
FOR EACH ROW
BEGIN
    UPDATE cart
    SET totalPrice = totalPrice + (
        select price from product
        where product.pid = new.pid
    )*new.quantity - (
        select price from product
        where product.pid = old.pid
    )*old.quantity
    where cartid = new.cartid;
END;

CREATE TRIGGER calcTotalPrice3
AFTER DELETE ON addedto
FOR EACH ROW
BEGIN
    UPDATE cart
    SET totalPrice = totalPrice - (
        select price from product
        where product.pid = old.pid
    )*old.quantity where cartid = old.cartid;
END;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
(MySQLdb.OperationalError) (1065, 'Query was empty')
(Background on this error at: http://sqlalche.me/e/e3q8)

In [23]:
%%sql
select * from cart where cartid = 194

 * mysql+mysqldb://root:***@localhost/
1 rows affected.

[(194, 38.6, 1866, datetime.date(2023, 1, 12), 5.0, 'Delivered')]

In [24]:
%%sql
insert into addedto values (3670,194,10);
select * from cart where cartid = 194

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.

[(194, 410.6, 1866, datetime.date(2023, 1, 12), 5.0, 'Delivered')]

Modify product prices on sales to be used for sales

In [25]:
%%sql
CREATE TRIGGER setSale
BEFORE UPDATE ON product
FOR EACH ROW
BEGIN
    IF new.saleid is not null and old.saleid is not null and old.saleid <> new.saleid THEN # sale a to sale b
        SET new.price = old.price / (100 - (
            select amount from sale
            where sale.saleid = old.saleid
        )) * (100 - (
            select amount from sale
            where sale.saleid = new.saleid
        ));
    ELSEIF new.saleid is not null and old.saleid is null THEN # no sale to sale
        SET new.price = new.price - new.price / 100 * (
            select amount from sale
            where sale.saleid = new.saleid
        );
    ELSEIF new.saleid is null and old.saleid is not null THEN # sale to no sale
        SET new.price = new.price * 100 /(100-(
            select amount from sale
            where sale.saleid = old.saleid
        ));
    END IF;
END;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
(MySQLdb.OperationalError) (1065, 'Query was empty')
(Background on this error at: http://sqlalche.me/e/e3q8)

In [26]:
%%sql
select * from product where pid = 3512

 * mysql+mysqldb://root:***@localhost/
1 rows affected.

[(3512, 'Cat Ears 2.0', 5, 'Accessories', None, 9999.0, 3468, 6433, datetime.date(2023, 1, 11))]

In [27]:
%%sql
update product set saleid = null where pid = 3512;
select * from product where pid = 3512

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.

[(3512, 'Cat Ears 2.0', 5, 'Accessories', None, 16665.0, None, 6433, datetime.date(2023, 1, 11))]

In [28]:
%%sql
update product set saleid = 856 where pid = 3512;
select * from product where pid = 3512

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.

[(3512, 'Cat Ears 2.0', 5, 'Accessories', None, 8332.5, 856, 6433, datetime.date(2023, 1, 11))]

In [29]:
%%sql
update product set saleid = 3468 where pid = 3512;
select * from product where pid = 3512

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.

[(3512, 'Cat Ears 2.0', 5, 'Accessories', None, 9999.0, 3468, 6433, datetime.date(2023, 1, 11))]

Decrease stock when product is added to order.

In [30]:
%%sql
CREATE TRIGGER setStock1
AFTER INSERT ON addedto
FOR EACH ROW
BEGIN
    UPDATE product
    SET stock = stock - new.quantity where product.pid = new.pid;
END;

CREATE TRIGGER setStock12
AFTER UPDATE ON addedto
FOR EACH ROW
BEGIN
    UPDATE product
    SET stock = stock - new.quantity + old.quantity where product.pid = new.pid;
END;

CREATE TRIGGER setStock3
AFTER DELETE ON addedto
FOR EACH ROW
BEGIN
    UPDATE product
    SET stock = stock + old.quantity where product.pid = old.pid;
END;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
(MySQLdb.OperationalError) (1065, 'Query was empty')
(Background on this error at: http://sqlalche.me/e/e3q8)

In [31]:
%%sql
select * from product where pid = 3670

 * mysql+mysqldb://root:***@localhost/
1 rows affected.

[(3670, 'Ripped Skater Pants', 38, 'Pants', 'M', 37.2, 658, 8757, datetime.date(2023, 1, 1))]

In [32]:
%%sql
insert into addedto values (3670,24,10);
select * from product where pid = 3670

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.

[(3670, 'Ripped Skater Pants', 28, 'Pants', 'M', 37.2, 658, 8757, datetime.date(2023, 1, 1))]

In [33]:
%%sql
delete from addedto where cartid = 24 and pid = 3670;
select * from product where pid = 3670

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.

[(3670, 'Ripped Skater Pants', 38, 'Pants', 'M', 37.2, 658, 8757, datetime.date(2023, 1, 1))]

<hr>
© NUS High School of Math & Science